package day5;

public class 학습목표정리_1주차 {

	public static void main(String[] args) {
		/* 각 Chapter 의 학습 목표


			ㅡ변수
		필요한 정보를 저장하기 위해서 변수를 선언할 수 있다.
		- 자료형(변수타입)
		- 변수 선언 및 초기화 방법
		- 변수명 작성 규칙 및 권고사항(관례)
		- 자료형변환 : 자동 , 명시적
		- 콘솔 입/출력
		
			ㅡ연산자
		연산자의 종류와 그에 따른 결과 값을 계산할 수 있다.
		- 대입 , 산술 , 논리 , 비교 , 증감 , 조건선택 , 비트
		- 조건식 : 결과가 참 또는 거짓으로 나오는 식
			ex)다음 중 조건식에 해당하는 것은? 2,5
			    1.num = 10                          
			    2.x > 10
			    3.x = x+1
			    4.x++
			    5.x>= && x<=100
		
			ㅡ조건문
		조건문을 이용하여 원하는 문제를 해결할 수 있다.
		- ~하면 ..한다.
		- 조건식 : ~,실행문 :...
		
			ㅡ반복문
		반복문을 이용하여 원하는 문제를 해결할 수 있다.
		- 반복문 문제는 반복횟수와 규칙성을 찾는 것이 중요하다.
		
			ㅡ배열
		-
*/

	}

}
